---
kind: property
id: P:Autodesk.Revit.DB.OverrideGraphicSettings.IsSurfaceForegroundPatternVisible
source: html/8602c881-c7e2-c0a5-bff0-2ec53f558405.htm
---
# Autodesk.Revit.DB.OverrideGraphicSettings.IsSurfaceForegroundPatternVisible Property

The visibility of the surface foreground fill pattern.

## Syntax (C#)
```csharp
public bool IsSurfaceForegroundPatternVisible { get; }
```